i=9
while i>=1:#因為被乘數是遞減的所以從i=9開始用圈減一直到i<1跳出迴圈,以下執行一樣的方式,%-2d使乘積靠左排列
    print(str(i),"x 9",'=',"%-2d" % (9*i),"    ",str(i),"x 8",'=',"%-2d" % (8*i),"    ",str(i),"x 7",'=',"%-2d" % (7*i))
    i-=1
print()
i=9
while i>=1:
    print(str(i),"x 6",'=',"%-2d" % (6*i),"    ",str(i),"x 5",'=',"%-2d" % (5*i),"    ",str(i),"x 4",'=',"%-2d" % (4*i))
    i-=1
print()
i=9
while i>=1:
    print(str(i),"x 3",'=',"%-2d" % (3*i),"    ",str(i),"x 2",'=',"%-2d" % (2*i),"    ",str(i),"x 1",'=',"%-2d" % (1*i))
    i-=1

